## KOCW 데이터베이스 시연(`R`)

In [13]:
library(DBI)
library(RSQLite)
library(readxl)

In [14]:
conn = dbConnect(SQLite(), "kocw.db")

In [15]:
dbListTables(conn)

[1] "charge"         "course_classed" "norm_course"    "professor"
[5] "university"

### 1. 기본키 설정이 맞는지 확인 + 튜플의 수정 및 삭제

`-` 중복되지 않는 기본키를 가지는 튜플 삽입 시(정상조작)

In [33]:
## professor 중복되지 않는 기본키를 가지는 튜플 삽입 시 정상
dbExecute(conn, "INSERT INTO professor VALUES(-1, '강신성', '자연계열', '전북대학교')")
dbGetQuery(conn, "SELECT * FROM professor LIMIT 5")

## 수정
dbExecute(conn, "UPDATE professor SET 제공대학명 = '1조대학교' WHERE 교수코드 = -1")
dbGetQuery(conn, "SELECT * FROM professor LIMIT 5")

## 삭제
dbExecute(conn, "DELETE FROM professor WHERE 교수코드 = -1")
dbGetQuery(conn, "SELECT * FROM professor LIMIT 5")

[1] 1

  교수코드 담당교수명 담당분야 제공대학명
1 -1       강신성     자연계열 전북대학교
2  0       안상욱     자연계열 한경대학교
3  1       이중호     자연계열 가천대학교
4  2       최수한     자연계열 단국대학교
5  3       김문현     자연계열 성균관대학교

[1] 1

  교수코드 담당교수명 담당분야 제공대학명
1 -1       강신성     자연계열 1조대학교
2  0       안상욱     자연계열 한경대학교
3  1       이중호     자연계열 가천대학교
4  2       최수한     자연계열 단국대학교
5  3       김문현     자연계열 성균관대학교

[1] 1

  교수코드 담당교수명 담당분야 제공대학명
1 0        안상욱     자연계열 한경대학교
2 1        이중호     자연계열 가천대학교
3 2        최수한     자연계열 단국대학교
4 3        김문현     자연계열 성균관대학교
5 4        이상준     자연계열 덕성여자대학교

In [50]:
## university 중복되지 않은 기본키를 가지는 튜플 삽입 시 정상
dbExecute(conn, "INSERT INTO university VALUES('1조대학교', '뉴욕', '사립')")
dbGetQuery(conn, "SELECT * FROM university LIMIT 10 OFFSET 182")
dbExecute(conn, "DELETE FROM university WHERE 제공대학명 = '1조대학교'")

[1] 1

  제공대학명             대학소재지     구분
1 사이버한국외국어대학교 서울특별시     사립
2 수원대학교             경기도         사립
3 구미대학교             경상북도       사립
4 가톨릭관동대학교       강원특별자치도 사립
5 1조대학교              뉴욕           사립

[1] 1

`-` 중복되는 기본키를 가지는 튜플 삽입 시(비정상 조작)

In [36]:
## 중복되는 기본키를 가지는 튜플 삽입 시 오류 발생 -> 정상적으로 기본키 설정됨
dbExecute(conn, "INSERT INTO professor VALUES(1, '강신성2', '자연계열', '전북대학교')")

ERROR: Error: UNIQUE constraint failed: professor.교수코드

In [46]:
## 중복되는 기본키를 가지는 튜플 삽입 시 오류 발생 -> 정상적으로 기본키 설정됨
dbExecute(conn, "INSERT INTO university VALUES('전북대학교', '뉴욕', '국립')")

ERROR: Error: UNIQUE constraint failed: university.제공대학명

### 2. 기본키 삭제에 따른 외래키의 변화 확인

`-` 외래키가 있는 릴레이션의 CASCADE / SET NULL 기준 서술

1. 담당교수 릴레이션

   * 소속대학명 `ON UPDATE CASCADE, ON DELETE SET NULL`

   > UPDATE : 소속된 대학의 이름이 바뀌어도 교수가 그 대학에 소속되었다는 사실은 변하지 않음.
   >
   > DELETE : 소속된 대학이 사라져도 교수는 강의를 제공했기 때문에 교수에 대한 정보를 유지하고자 함.

3. 강의 릴레이션

    * 제공대학명 `ON UPDATE CASCADE, ON DELETE CASCADE`
  
   > UPDATE : 제공한 대학의 이름이 바뀌어도 그 대학이 강의를 제공했었다는 사실은 변하지 않음
   >
   > DELETE : 제공한 대학이 사라져도 제공되었던 강의 정보를 유지하고자 함.

    * 강의명 `ON UPDATE CASCADE, ON DELETE CASCADE`
  
    > UPDATE : 기존에 있었던 강의명이 바뀌어도 다른 속성값들은 그대로임.
    >
    > DELETE : 강의명을 없앤다는 것 자체의 의도가 해당 강의를 없애고 싶다는 의미이므로

3. 담당 릴레이션

> ON UPDATE CASCADE, ON DELETE CASCADE

In [17]:
dbGetQuery(conn, "SELECT * FROM professor LIMIT 5")

  교수코드 담당교수명 담당분야 제공대학명
1 -1       강신성     자연계열 전북대학교
2  0       안상욱     자연계열 한경대학교
3  1       이중호     자연계열 가천대학교
4  2       최수한     자연계열 단국대학교
5  3       김문현     자연계열 성균관대학교

In [22]:
dbExecute(conn, "UPDATE professor SET ")

ERROR: Error: UNIQUE constraint failed: charge.교수코드, charge.강의코드

In [ ]:
dbExecute(conn, "INSERT")

In [ ]:
dbExecute(conn, "DELETE FROM professor WHERE 교수코드 = 0")

In [21]:
dbGetQuery(conn, "SELECT * FROM charge LIMIT 20")

   교수코드 강의코드
1   0       1095582
2   1       1104074
3   2       1110603
4   3       1112400
5   4       1118072
6   4       1118158
7   5       1118268
8   6       1123826
9   7       1125165
10  8       1127202
11  0       1128714
12  9       1128876
13 10       1128981
14 11       1130882
15 12       1131651
16 13       1132857
17  5       1133115
18 14       1135672
19 15       1135717
20 14       1135792

In [13]:
dbGetQuery(conn, "SELECT * FROM sqlite_schema WHERE name = 'charge'")

  type  name   tbl_name rootpage
1 table charge charge   2
  sql
1 CREATE TABLE charge (\n  교수코드 INTEGER,\n  강의코드 INTEGER,\n  PRIMARY KEY (교수코드, 강의코드),\n  FOREIGN KEY (교수코드) \n  REFERENCES professor(교수코드),\n  FOREIGN KEY (강의코드) \n  REFERENCES norm_course(강의코드)\n)

In [1]:
professor_data <- read_excel("C:/Users/leesj/Downloads/professor (2).xlsx")
course_classed_data <- read_excel("C:/Users/leesj/Downloads/course_classed (2).xlsx")
norm_course_data <- read_excel("C:/Users/leesj/Downloads/norm_course (3).xlsx")
charge_data <- read_excel("C:/Users/leesj/Downloads/charge (3).xlsx")
university_data <- read_excel("C:/Users/leesj/Downloads/university (3).xlsx")

professor_data <- professor_data[,-1]
course_classed_data <- course_classed_data[,-1]
norm_course_data <- norm_course_data[,-1]
charge_data <- charge_data[,-1]
university_data <- university_data[,-1]

names(university_data)[names(university_data) == "대학소재지(시/도)"] <- "대학소재지"
names(university_data)[names(university_data) == "사립/국립 구분"] <- "구분"

conn <- dbConnect(RSQLite::SQLite(), "kocw.db")

dbExecute(conn, "PRAGMA foreign_keys = ON")

dbExecute(conn, "
CREATE TABLE charge (
  FOREIGN KEY (교수코드) 
  REFERENCES professor(교수코드)
  ON UPDATE SET CASCADE
  ON DELECT SET NULL,
  FOREIGN KEY (강의코드) 
  REFERENCES norm_course(강의코드)
  ON UPDATE CASCADE
  ON DELECT SET NULL,
  PRIMARY KEY (교수코드, 강의코드)
)")

dbExecute(conn, "
CREATE TABLE norm_course (
  강의코드 INTEGER PRIMARY KEY,
  강의명 TEXT,
  강의년도 INTEGER,
  강의학기 INTEGER,
  제공대학명 TEXT,
  제공일자 TEXT,
  FOREIGN KEY (제공대학명) 
  REFERENCES university(제공대학명)
)")

dbExecute(conn, "
CREATE TABLE course_classed (
  강의명 TEXT PRIMARY KEY,
  교육분류 TEXT
)")

dbExecute(conn, "
CREATE TABLE professor (
  교수코드 INTEGER PRIMARY KEY,
  담당교수명 TEXT,
  담당분야 TEXT,
  제공대학명 TEXT,
  FOREIGN KEY (제공대학명)
  REFERENCES university(제공대학명)
)")

dbExecute(conn, "
CREATE TABLE university (
  제공대학명 TEXT PRIMARY KEY,
  대학소재지 TEXT,
  구분 TEXT
)")

dbWriteTable(conn, "university", university_data, append = TRUE, row.names = FALSE)
dbWriteTablea(conn, "professor", professor_data, append = TRUE, row.names = FALSE)
dbWriteTable(conn, "norm_course", norm_course_data, append = TRUE, row.names = FALSE)
dbWriteTable(conn, "course_classed", course_classed_data, append = TRUE, row.names = FALSE)
dbWriteTable(conn, "charge", charge_data, append = TRUE, row.names = FALSE)


dbListTables(conn)



dbDisconnect(conn)

ERROR: Error in read_excel("C:/Users/leesj/Downloads/professor (2).xlsx"): could not find function "read_excel"